#include<stdio.h>
//存储3-浮点数的存储 
//浮点数存储格式与整型不同 
int main()
{
	int n = 9;
	//存储：00000000 00000000 00000000 00001010
	float* pf=(float*)&n;
	//强行以floar拿出：0（E符号位：0为正1为负）00000000（E指数：（全0）1-127） 0000000 00000000 00001010（M有效数字） 
	//0.0000000 00000000 00001010*2^(-126)=>1.001*2^(-146)(趋近于零) 
	//故*pf输出为0.000000 
	printf("n的值为：%d\n",n);
	printf("*pf的值为：%f\n",*pf);
	
	*pf=9.0;
	//1010 
	//存储：0(S) 10000010(E) 0010000 00000000 00000000(M)
	printf("改后n值:%d\n",n);
	//强行int出来： 01000001000100000000000000000000转十进制 故输出1091567616 
	printf("改后*pf值：%f\n",*pf);
	//n的值为：9
	//*pf的值为：0.000000
	//改后n值:1091567616
	//改后*pf值：9.000000 
	return 0;
}
